{
  "system": "You are assisting humans doing web navigation tasks step by step. At each stage, you can see the webpage by a screenshot and know the previous actions defined in Previous Actions before the current step, decided by yourself that have been executed for this task through recorded history. You need to decide on the first **following action** to take.\n\nHere are the descriptions of all **allowed actions**:\n\nNo Value Operations:\n- CLICK: Click on a webpage element using the mouse. **Do not use CLICK if the intended action is to enter text — use TYPE instead for input fields.**\n- HOVER: Move the mouse over a webpage element without clicking.\n- PRESS ENTER: Press the Enter key, **after you have TYPE operation to reveal the search results**.\n- SCROLL UP: Scroll the webpage upward by half the window height. This action is used to help navigate the page when the required element is not currently visible.  You don't need to click scroll bar to perform SCROLL UP.\n- SCROLL DOWN: Scroll the webpage downwards by half the window height. This action is used to help navigate the page when the required element is not currently visible. You don't need to click scroll bar to perform SCROLL DOWN.\n- TERMINATE: End the current task, typically used when the task is considered complete or requires potentially harmful actions.\n- NONE: Indicates that no action is necessary at this stage. Used to skip an action or wait.\n\nWith Value Operations:\n- SELECT: Choose an option from a dropdown menu or <select> element. The value indicates the option to select. You should consider this action when you need to enter date.\n- TYPE: Enter text into a text area or text box. The value is the text to be typed. You should consider this action first when you need to search something.",
  "user": [
    "You are asked to complete the following task: Add a bird bath under $30 to my cart.\n\nPrevious Actions: [TYPE-> bird bath, PRESS ENTER, SCROLL DOWN]\n\n The screenshot below shows the current webpage. You need to check the list following \"Previous Actions:\" and summarize what has already been done **in a short sentence** before predicting the next action. **Think step by step before deciding the next action.** You need to clearly identify the most likely target element the user should interact with — describe its location as precisely as possible, and ensure it is visible in the screenshot (do not invent elements). Then, specify the corresponding operation to perform on that element.\n\nTo be successful, **you have to follow the following eight rules**: \n1. You should only predict **one** action at a time given the current observation. Because as an agent, you cannot execute multiple actions simultaneously.\n2. You should always first TYPE the product name **without any conditions** into an search bar to start searching, the place is usually in the top of the page. \n3. You should not include any conditions or requirements in the search bar. For example, if the user wants to search a product A under $100, you should only TYPE \"A\" into the search bar and to intial search.\n4. **PRESS ENTER after you TYPE searching product name** in the search bar, it will jump to the results page.\n5. After initial searching, in the **results page**, you should scanning the page and then **choose the product card that best matches the user's requirements**. You should perform SCROLL DOWN to see more information if needed.\n6. In summary, type - press enter - scroll down the page to see the price of the products in the screenshot - choose product - add to cart.\n7. You should **ignore menu bars, navigation links, result summary like total number of results or banners** unless they are directly relevant to the instruction.\n8. Terminate when you deem the task complete or if it requires potentially harmful actions.",
    "(Reiteration)\nFirst, reiterate your next target element, its detailed location, and the corresponding operation.\n\n(Multichoice Question)\nBelow is a multi-choice question where each option corresponds to an HTML element on a webpage. You should use these coordinates, along with the screenshot, to determine their position and content. Your task is to identify the element that matches the **first predict action** described in the instruction. Usually it appears after summarization of previous action. If multiple predict actions are present, you should only complete the **first one**. \n\nTo choose correctly you should follow the five rules:\n1. If the next action is to **scroll down the page**, you should set \"ACTION\" to be \"SCROLL DOWN\".\n2. Carefully identify which is the correct predicted action to complete. Do not invent or predict any new action at this stage. You should complete only the first predicted action described in the instruction.\n3. You should **use the screenshot to locate each element visually on the page**. Examine each element's **text content**, HTML attributes, and **its screen location**.\n4. You should **ignore menu bars, navigation links, result summary like total number of results or banners** unless they are directly relevant to the instruction.\n5. If you do not see the predicted element in the screenshot or multichoice question, you should **set ELEMENT to be None**.\n\nThink carefully before answering. Reason through your choice by comparing the **instruction**, the **visual position**, and the **text/label content**. Only choose the element that best satisfies all three.\n\n\nIf none of these elements match your target element or your target action doesn't involve an element, please select P.\nA. (0.858, 0.532) <a\">Enchanted Garden® 18\" Peacock Glass Birdbath</a>\nB. (0.192, 0.089) <button type=\"button\"\">OFFIn Stock Today</button>\nC. (0.355, 0.836) <button type=\"button\"\">Add To Cart</button>\nD. (0.109, 0.836) <button type=\"button\"\">Add To Cart</button>\nE. (0.847, 0.836) <button type=\"button\"\">Add To Cart</button>\nF. (0.919, 0.089) <button type=\"button\"\">Sort: Best Match</button>\nG. (0.36, 0.532) <a\">Enchanted Garden® 18\" Butterflies & Flowers Glass Birdbath</a>\nH. (0.955, 0.027) <a\">Click to go to your cart. Cart</a>\nI. (0.975, 0.008) <input type=\"checkbox\"\">parent_node: Compare</input>\nJ. (0.073, 0.089) <button type=\"button\"\">All Filters</button>\nK. (0.729, 0.008) <input type=\"checkbox\"\">parent_node: Compare</input>\nL. (0.483, 0.008) <input type=\"checkbox\"\">parent_node: Compare</input>\nM. (0.483, 0.889) <input type=\"checkbox\"\">parent_node: Compare</input>\nN. (0.729, 0.889) <input type=\"checkbox\"\">parent_node: Compare</input>\nO. (0.975, 0.889) <input type=\"checkbox\"\">parent_node: Compare</input>\nP. None of the other options match the correct element or the action doesn't involve an element.\n\n(Final Answer)\nFinally, conclude your answer using the format below. Ensure your answer is strictly adhering to the format provided below. Please do not leave any explanation in your answers of the final standardized format part, and this final part should be clear and certain. The element choice, action, and value should be in three separate lines.\n\nFormat:\n\nELEMENT:  The uppercase letter of your selected choice (e.g., A, B, C). If the action is no value operation, the element should be None. \n\nACTION: **Choose one action from the list of allowed actions**. Your response should only contain the action name, written in ALL CAPITAL LETTERS — no extra words, explanations, or punctuation.\n\nVALUE: Provide the appropriate input based on the selected ACTION. If the action requires input (e.g., TYPE), provide the exact text to be used. If the action does **not** require input (e.g., CLICK, PRESS ENTER, SCROLL DOWN), write \"None\"."
  ],
  "assistant": "The previous actions have been to type \"bird bath\" into the search bar, press enter, and scroll down the page. The next action should be to find a bird bath that is under $30 and add it to the cart. To do this, the user should scan the product cards on the page and choose the one that best matches their requirements. Once the desired bird bath is found, the user should click on the \"Add to Cart\" button."
}